import streamlit as st

st.set_page_config(page_title='多页面应用-侧边导航', page_icon='💯')

st.title("主页")

st.image('https://www.gxvnu.edu.cn/__local/7/4F/5D/AD938A49125924C082992B16BDD_98ECEA17_BD556.jpg', use_container_width=True)

st.text('''
    广西职业师范学院（原广西经济管理干部学院）坐落于广西首府南宁市风景秀丽的邕江之滨、相思湖畔，是自治区人民政府直属、自治区教育厅主管的公办全日制普通本科学校，致力于培养区域经济社会发展所需要的高素质应用型、技术技能型人才和职业教育师资。
    学校随着广西的解放而诞生，其前身为创建于1951年5月的广西省行政干部训练班。其后，为适应不同历史时期广西经济建设需要，学校历经了广西人民革命大学、广西行政干部学校、广西经济干部学校、广西经济管理干部学院等历史沿革，并于2019年6月经教育部批准设置为“广西职业师范学院”。在不同历史时期，学校聚焦“服务广西经济建设”发展主线，不忘建校初心、勇担办学使命，为广西经济建设和社会发展作出了不可磨灭的突出贡献，享有良好的办学声誉和广泛的社会影响。近年来，学校围绕“地方性、应用型、职师类”办学定位，落实“以本为本、应用为先、职师特色”办学思路，在服务地方产业转型升级和职业教育提质增效上取得显著成效。
    学校拥有一支师德师风优良、学术水平较高、教学经验丰富的专兼职师资队伍，其中，取得硕士、博士学位教师427人。拥有包含自治区教学名师、模范教师、优秀专家、高校思想政治教育卓越教师等在内的高水平教师团队，其中，广西高等学校高水平创新团队2个，自治区课程思政教学团队5个，自治区劳模创新工作室1个。在近年教学成果评选中，获国家级、自治区级教学成果奖16项，其中，获国家级教学成果奖一等奖1项、二等奖1项；获自治区教学成果一等奖4项、二等奖6项，三等奖4项。近五年来，获厅级及以上纵向科研项目立项285项，其中国家级1项、省部级57项、厅级227项；获省部级科研成果奖6项，其中二等奖1项、三等奖5项。
    学校现有12个二级学院（部），普通本科专业33个，涵盖经济学、管理学、工学、理学、教育学、文学、法学、艺术学等八个学科。获教育部“新工科”研究与实践项目1个，自治区级新工科、新文科研究与实践项目2项，广西高等学校特色专业及课程一体化建设项目3个，自治区级本科一流课程4门，自治区级课程思政示范课5门,自治区级虚拟教研室建设试点2个，广西高校重点实验室1个，自治区级实验教学中心2个，自治区级协同育人平台1个，自治区中小学生研学实践教育基地、劳动教育实践基地各1个。建有新工科协同育人中心等100多个校内外实习实训基地，与多所广西中职学校共建职业教育实习基地。近年来，以加强创新创业教育为抓手，全面促进人才培养供给侧和产业发展需求侧结构要素全方位融合，应用型人才培养质量广受认可，连续被评为广西普通高校毕业生就业创业工作突出单位，也是全区普通高校招生录取工作表现突出单位。
    学校曾中标获得6项广西重大课题，并承担“推动广西经济高质量发展的重点方向和路径对策研究”等多项自治区党委、政府资政课题以及自治区工信厅、国家发展改革委、财政厅等部门专项课题的研究工作，完成自治区两化融合项目“广西新能源汽车监测平台”的建设，凸显了服务广西的特色和优势。与广西西江开发投资集团高质量共建“广西船联网工程技术研究中心”等多个校企深度合作项目，积极推进产教融合、科技创新成果转化工作，大力开展面向中小微企业的技术服务、咨询服务活动。学校还是广西干部教育培训高校基地、第七批自治区级专业技术人员继续教育基地、自治区职业教育师资培养培训基地、广西知识产权培训基地、广西生态环境保护综合行政执法实训基地以及企业经营管理人员培训基地，培训了一大批高素质党政干部、“双师型”职教师资和企业经营管理人才。
面向未来，学校将坚守建校初心、牢记办学使命，紧扣“创新性驱动，特色化建设，内涵式提升，高质量发展”总要求，深化产教融合、校企合作，推进工学结合、知行合一，努力将学校办成特色鲜明的高水平普通本科学校，在全面建设新时代壮美广西新征程中再谱新篇、再续华章。
    （学校办公室提供，数据信息统计截至2025年3月14日）
''')

